/*
  马尔可夫链
- 初始概率Pi：实际问题中指分析历史资料得到的某一状态出现的频率。假设某事件有Si(i=1,2,3...)个状态，在已知历史资料中，状态Si出现的次数为Mi,资料总个数为N，这时Si出现的概率为Fi=Mi/N。当样本足够大时，用频率Fi代替概率Pi的误差就会足够小。
- 状态概率：系统在某一时期处于某一状态的概率，称为状态概率向量。
- 稳定状态概率：系统在一定的一次转移概率条件下，经过多次转移，处于某种状态的概率趋向一个常数。
*/

// 题目：编程求解马尔可夫链，预测未来20年家庭居民收入结构变化情况

# include <stdio.h>
# include <math.h>
# define N 20

int main(){
    double P[3] = {0.4807, 0.4310, 0.0883}; // 初始状态
    double A[3][3] = {{0.8259, 0.1510, 0.023},
                    {0.1044, 0.8157, 0.0799},
                    { 0, 0.2625, 0.7375}}; // 概率矩阵
    double result[3];
    double PI[3];
    int i;
    for(i = 0;i < 3;i++){
        PI[i] = P[i];
    }

    printf("未来20年的家庭居民收入结构变化情况结果是：\n");

    int j,k,e;
    for(i = 0;i < N; i++){
        printf("第%d年为：\n",i+1);
        for(j = 0;j < 3;j++){
            result[j] = 0;
            for(k = 0;k < 3; k++){            
                result[j] += PI[k] * A[k][j]; // 遵循马尔可夫链的数学规则
            }
        }
        
        for(e = 0; e < 3; e++){
            PI[e] = result[e];
            printf("%.6f\t",result[e]);
        }
        printf("\n");
    }


    return 0;
}
